{
  "Home": "Início",
  "About me": "Sobre mim",
  "Projects": "Projetos",

  "Hi, I'm Gustavo": "Olá, eu sou o Gustavo",
  "I'm a Full Stack Developer.": "Sou um Desenvolvedor Full Stack.",

  "Living in Santa Catarina, Brazil": "Morando em Santa Catarina, Brasil",
  "Software Developer at LabSec-Ufsc": "Desenvolvedor de Software no LabSec-Ufsc",
  "Studying Computer Science at UFSC": "Estudando Ciência da Computação na UFSC",
  "Learning new things every day": "Aprendendo coisas novas todos os dias",

  "Experience": "Experiência",
  "Academic Formation": "Formação Acadêmica",
  
  "Scientific Initiation": "Iniciação Científica",
  "Aug:2020 - Sep:2021": "Ago:2020 - Set:2021",
  "PET Computação - UFSC": "PET Computação - UFSC",
  "During the period I was at PET da Computação - UFSC, I gained experience in the area of scientific initiation with the Dependency Rule Modeling project for Multiple Aspects Trajectories, I also worked as a coordinator of digital content, supporting teachers in creating websites and managing social media of PET. I joined as a volunteer in the first semester of my graduation and became a scientific initiation scholarship holder in the second semester.": "Durante o período que estive no PET da Computação - UFSC, adquiri experiência na área de iniciação científica com o projeto Modelagem de Regras de Dependência para Trajetórias de Múltiplos de Aspectos, também atuei como coordenador de conteúdo digital, apoiando professores na criação de sites e gerenciamento das redes sociais do PET. Entrei como voluntário no primeiro semestre da minha graduação e me tornei bolsista de iniciação científica no segundo semestre.",
  
  "Internship in a security laboratory": "Estágio em um laboratório de segurança",
  "Sep:2021 - Present": "Set:2021 - Presente",
  "LabSec - UFSC": "LabSec - UFSC",
  "My experience at the Computer Security Laboratory began working with the PBAD - Padrão brasileiro de assinatura digital. In an application development project for validating digital documents. \nThe main objective of this Research Project was to provide a specialized solution that meets the specific legislation of Brazilian bodies in the context of digital signatures for validating digitally signed electronic documents of a specific nature. \nI worked mainly on the creation of a mobile application that validates a document through requests by reading a qrCode.": "Minha experiência no Laboratório de Segurança em Computação teve início trabalhando com o PBAD - Padrão brasileiro de assinatura digital. Em um projeto de desenvolvimento de aplicações para validação de documentos digitais. \nO objetivo principal deste Projeto de Pesquisa era fornecer uma solução especializada que atenda à legislação específica de órgãos brasileiros no contexto de assinaturas digitais para validação de documentos eletrônicos de cunho específico assinados digitalmente. \nTrabalhei principalmente na criação de um aplicativo mobile que faz a validação de um documento através de requisições lendo um qrCode.",

  "Computer Science": "Ciência da Computação",
  "2020 - Present": "2020 - Presente",
  "UFSC - Universidade Federal de Santa Catarina": "UFSC - Universidade Federal de Santa Catarina",
  "Bachelor": "Bacharelado"
}
  