{
  "Home": "Início",
  "About me": "Sobre mim",
  "Projects": "Projetos",
  "Project Summary": "Resumo do Projeto:",
  "Project Details": "Detalhes do Projeto:",

  "Hi, I'm Gustavo": "Olá, meu nome é Gustavo",
  "I'm a Full Stack Developer.": "Sou um Desenvolvedor Full Stack.",

  "Living in Santa Catarina, Brazil": "Morando em Santa Catarina, Brasil",
  "Software Developer at LabSec-Ufsc": "Desenvolvedor de Software no LabSec-Ufsc",
  "Studying Computer Science at UFSC": "Estudando Ciência da Computação na UFSC",
  "Learning new things every day": "Aprendendo coisas novas todos os dias",

  "Experience": "Experiência",
  "Academic Formation": "Formação Acadêmica",

  "Scientific Initiation": "Iniciação Científica",
  "Aug:2020 - Sep:2021": "Ago-2020 : Set-2021",
  "PET Computação - UFSC": "PET Computação - UFSC",
  "During the period I was at PET da Computação - UFSC, I gained experience in the area of scientific initiation with the Dependency Rule Modeling project for Multiple Aspects Trajectories, I also worked as a coordinator of digital content, supporting teachers in creating websites and managing social media of PET. I joined as a volunteer in the first semester of my graduation and became a scientific initiation scholarship holder in the second semester.": "Durante o período que estive no PET da Computação - UFSC, adquiri experiência na área de iniciação científica com o projeto Modelagem de Regras de Dependência para Trajetórias de Múltiplos de Aspectos, também atuei como coordenador de conteúdo digital, apoiando professores na criação de sites e gerenciamento das redes sociais do PET. Entrei como voluntário no primeiro semestre da minha graduação e me tornei bolsista de iniciação científica no segundo semestre.",

  "Internship in a security laboratory": "Bolsista em um Laboratório de Segurança",
  "Sep:2021 - Present": "Set-2021 : Presente",
  "LabSec - UFSC": "LabSec - UFSC",
  "My experience at the Computer Security Laboratory began working with the PBAD - Padrão brasileiro de assinatura digital. In an application development project for validating digital documents. The main objective of this Research Project was to provide a specialized solution that meets the specific legislation of Brazilian bodies in the context of digital signatures for validating digitally signed electronic documents of a specific nature. I worked mainly on the creation of a mobile application that validates a document through requests by reading a qrCode.": "Minha experiência no Laboratório de Segurança em Computação teve início trabalhando com o PBAD - Padrão brasileiro de assinatura digital. Em um projeto de desenvolvimento de aplicações para validação de documentos digitais. O objetivo principal deste Projeto de Pesquisa era fornecer uma solução especializada que atenda à legislação específica de órgãos brasileiros no contexto de assinaturas digitais para validação de documentos eletrônicos de cunho específico assinados digitalmente. Trabalhei principalmente na criação de um aplicativo mobile que faz a validação de um documento através de requisições lendo um qrCode.",

  "Computer Science": "Ciência da Computação",
  "2020 - Present": "2020 - Presente",
  "UFSC - Universidade Federal de Santa Catarina": "UFSC - Universidade Federal de Santa Catarina",
  "Bachelor": "Bacharelado",

  "Dependency Rule Modeling for Multiple Aspects Trajectories": "Modelagem de Regras de Dependência para Trajetórias de Múltiplos de Aspectos",
  "PBAD Brazilian digital signature standard": "PBAD - Padrão brasileiro de assinatura digital",
  "Show more": "Mostrar mais",

  "The main objective of this Research Project is to provide a specialized solution that meets the specific legislation of Brazilian bodies in the context of digital signatures for validating digitally signed electronic documents of a specific nature.": "O objetivo principal deste Projeto de Pesquisa é fornecer uma solução especializada que atenda à legislação específica de órgãos brasileiros no contexto de assinaturas digitais para validação de documentos eletrônicos de cunho específico assinados digitalmente.",
  "In Brazil, the use of digital signatures in electronic documents is regulated through Provisional Measure No. 2,200-2. Signed electronic documents permeate various aspects of society, such as contracts between entities, medical prescriptions, legal documents and invoices, and providing professional assistance in a fully digitized environment poses a series of challenges, among which stand out the need to guarantee the authenticity, integrity and veracity of documents used by service providers and their consumers.": "No Brasil a utilização de assinaturas digitais em documentos eletrônicos é regulamentada através da Medida Provisória N. 2.200-2. Documentos eletrônicos assinados permeiam vários aspectos da sociedade, como em contratos entre entidades, receitas médicas, documentos jurídicos e notas fiscais e fornecer assistência profissional em um ambiente totalmente digitalizado remete a uma série de desafios, dentre eles, destacam-se a necessidade da garantia da autenticidade, da integridade e da veracidade de documentos utilizados por prestadores de serviço e seus consumidores.",
  "In its electronic form, it is necessary that such documents are obtained and verified by the recipients in an agile and safe way, the whole process involves the validation of qualitative attributes of the people who sign a health document, therefore, we have to place new elements in evidence of something new to be done at ICP-Brasil in a structured way.": "Em sua forma eletrônica, é necessário que tais documentos sejam obtidos e verificados pelos destinatários de forma ágil e com segurança, todo processo envolve a validação de atributos qualitativos da pessoas que assinam um documento de saúde, sendo assim, temos à colocação de elementos novos em evidência algo novo a ser feito na ICP-Brasil de forma estruturada.",
  "Teleworking poses challenges, in pandemic times, this modality makes it possible to reduce the risk of transmission of pathologies between professionals and the population served. Teleworking, combined with the technologies used to make this modality possible, provides and enables the provision of assistance in remote or difficult-to-access environments. It is observed that there is currently limited support for the practice of telecommuting in certain institutions. Thus, it is important to encourage research in this line, to study the issuance of signed receipts, particularly standardized methods to allow the creation of an artifact that enables the user to prove that, at a certain point, a digitally signed document was subjected to a digital signature verification service, makes it possible to provide solutions that serve society in general.": "O teletrabalho impõe desafios, em tempos pandêmicos, essa modalidade possibilita reduzir riscos de transmissão de patologias entre profissionais e a população atendida. O teletrabalho aliado às tecnologias empregadas para tornar possível esta modalidade fornece e habilita a prestação de atendimento em ambientes remotos ou de difícil acesso. Observa-se que atualmente há suporte limitado para a prática do teletrabalho em certas instituições. Assim, destaca-se a importância em fomentar a pesquisa nessa linha, estudar sobre a emissão de recibos assinados, particularmente de métodos padronizados para permitir a criação de artefato que habilita ao usuário a prova de que, em certo momento, um documento assinado digitalmente foi submetido a um serviço de verificação de assinaturas digitais, viabiliza fornecer soluções que atendam a sociedade em geral.",

  "Trajectories of moving objects are usually modeled as sequences of space-time points or, in case of semantic trajectories, as labeled stops and moves. Data analytics methods on these kinds of trajectories tend to discover geometrical and temporal patterns, or simple semantic patterns based on the labels of stops and moves. A recent extension of semantic trajectories is called multiple aspects trajectory, i.e., a trajectory associated to different semantic dimensions called aspects. This kind of trajectory increases in a large scale the number of discovered patterns.": "Trajetórias de objetos em movimento são geralmente modeladas como sequências de pontos no espaço-tempo ou, no caso de trajetórias semânticas, como paradas e movimentos rotulados. Os métodos de análise de dados nesses tipos de trajetórias tendem a descobrir padrões geométricos e temporais, ou padrões semânticos simples baseados nos rótulos de paradas e movimentos. Uma extensão recente das trajetórias semânticas é chamada de trajetória de múltiplos aspectos, ou seja, uma trajetória associada a diferentes dimensões semânticas denominadas aspectos. Este tipo de trajetória aumenta em larga escala o número de padrões descobertos.",
  "This project introduced the concept of dependency rule to represent patterns discovered from the analysis of trajectories with multiple aspects. They included patterns related to a trajectory, trajectory points, or the moving object. These rules are conceptually represented as an extension of a conceptual model for multiple aspects trajectories. A case study shows that the proposal is relevant as it represents the discovered rules with a concise but expressive conceptual model. Additionally, a performance evaluation showed the feasibility of the conceptual model designed over relational-based database management technologies.": "Este projeto introduziu o conceito de regra de dependência para representar padrões descobertos a partir da análise de trajetórias com múltiplos aspectos. Eles incluíam padrões relacionados a uma trajetória, pontos de trajetória ou o objeto em movimento. Essas regras são representadas conceitualmente como uma extensão de um modelo conceitual para trajetórias de múltiplos aspectos. Um estudo de caso mostra que a proposta é relevante, pois representa as regras descobertas com um modelo conceitual conciso, mas expressivo. Além disso, uma avaliação de desempenho mostrou a viabilidade do modelo conceitual projetado sobre tecnologias de gerenciamento de banco de dados relacionais.",

  "404 - Project not Found": "404 - Projeto não encontrado",
  "PBAD/LabSec - Site": "PBAD/LabSec - Site",
  "Scientific article": "Artigo Científico",

  "In this project, I was able to delve deeper into the execution of benchmarks to test the performance of both SQL and NewSQL DBMS’s. Using the “OLTPBenchmark” tool, I implemented some query settings for PostgreSQL and VoltDB databases, and tested the performance of both with different amounts of data. The focus was to have a performance comparison between a NewSQL DBMS and an SQL DBMS.": "Neste projeto, consegui me aprofundar na execução de benchmarks para testar a performance de SGBDs tanto SQL, quanto SGBDs NewSQL. Utilizando a ferramenta “OLTPBenchmark”, eu implementei algumas configurações de queries para os banco de dados do PostgreSQL e do VoltDB, e testei a performance de ambos com diferentes quantidades de dados. O foco foi ter uma comparação de desempenho entre um SGBD NewSQL e um SGBD SQL.",
  "In this project I worked on the development of a digital document validator, with an initial focus on medical certificates and prescriptions. In the beginning, I worked in the research area, looking for a way to implement the validation API in an application for mobile devices, I started trying to use OpenSSL to validate attribute certificates offline in the application (which was implemented in Flutter with the implementation of the validator in the application having been done in Java), but at the time OpenSSL did not have enough support to make the validator work correctly, so a different way had to be found.": "Neste projeto eu trabalhei no desenvolvimento de um validador de documentos digitais, com foco inicial em certificados e prescrições médicas. No começo, atuei na área de pesquisa, procurando uma forma de implementar a API de validação em um aplicativo para dispositivos móveis, iniciei tentando utilizar o OpenSSL para a validação de certificados de atributos de forma offline no aplicativo (que foi implementado em Flutter com a implementação do validador no aplicativo tendo sido feita em Java), porém na época o OpenSSL não tinha suporte suficiente para fazer com que o validador funcionasse da forma correta, com isso foi preciso encontrar uma maneira diferente. ",
  "During this period, I started to focus on the validator application, which started to have validation only online through requests for the validator api configured with an endpoint, from then on, I started to work alone in the application, implementing what was requested by the ITI (National Institute of Information Technology).": "Nesse período comecei a ter o foco no aplicativo do validador, que passou a ter a validação apenas de forma online através de requisições para a api do validador configurada com um endpoint, daí em diante, passei a trabalhar sozinho no aplicativo, implementando o'que era pedido pelo ITI (Instituto Nacional de Tecnologia da Informação).",

  "In this project I worked on the development of a Student Management System using Django4, with the main objective of learning the framework and its functionalities. I used this project to learn more about the web development area.": "Neste projeto trabalhei no desenvolvimento de um Sistema de Gestão de Alunos utilizando Django4, com o objetivo principal de aprender o framework e suas funcionalidades. Usei esse projeto para aprender mais sobre a área de desenvolvimento web.",

  "Personal Project": "Projeto Pessoal",
  "Personal Project (Work in progress)": "Projeto Pessoal (Trabalho em andamento)",
  "Project - GitHub": "Projeto - GitHub",

  "Student Management System": "Sistema de Gestão de Alunos",
  "My focus in this project was centralized in the implementation of a User Authentication system, first I started implementing the student management system, which was too simple but very good to learn the basics of the framework and then I moved on to my idea, I initially implemented a zero authentication, functional but insecure the way it was, so I decided to implement it in a more secure way, which was using the Allauth lib, with this way it was much simpler and as the security part was practically ready, I chose this way as final for being more efficient.": "Meu foco nesse projeto estava centralizado na implementação de um sistema de Autenticação de Usuário, primeiramente comecei implementando o sistema de gerenciamento de estudante, que foi demasiadamente simples mas muito bom para aprender o básico do framework e depois eu passei para minha ideia, implementei inicialmente um sistema de autenticação do zero, funcional mas inseguro do jeito que estava, então decidi implementar de uma maneira mais segura, que foi utilizando a lib do Allauth, com essa forma foi bem mais simples e como a parte de segurança já estava praticamente pronta, escolhi essa forma como final por ser mais eficiente.",

  "OrfeuTunes - Music Streaming": "OrfeuTunes - Streaming de música",
  "OrfeuTunes - Music Streaming (Work in Progress)": "OrfeuTunes - Streaming de Música (Trabalho em Progresso)",
  "The main idea of the project is to create a music streaming application, where the user can listen to songs, create playlists, check the lyrics of the song, among other features, the project itself is a way for me to learn more about web development and dig deeper into some technologies.": "A ideia principal do projeto é criar um uma aplicação de streaming de música, onde o usuário pode ouvir músicas, criar playlists, verificar a letra da música, entre outras funcionalidades, o projeto em si é uma forma de eu aprender mais sobre desenvolvimento web e me aprofundar mais em algumas tecnologias.",
  "The initial implementation would be through the creation of an HTTP server from scratch, however because it is something quite complex and that would take some time to be done effectively and functionally, I decided to implement an HTTP server in another project and focus on that project using the Django Framework.": "A implementação inicial seria através da criação de um servidor HTTP do zero, porém por conta de ser algo meio complexo e que demandaria algum tempo para ser feito de forma efetiva e funcional, decidi fazer a implementação de um servidor HTTP em outro projeto e focar nesse projeto com a utilização do Framework Django.",

  "Solaru Idle (Work in Progress)": "Solaru Idle (Trabalho em Progresso)",
  "The main idea of this project is to create an alternative game mode for the acclaimed Warframe game, the new game mode is in the Idle style, where the player does not necessarily need to be playing all the time to be able to progress in it, the idea came up by the creators of this project (Me, @ThiagoCComelli and @MatheusAHM). So we decided to put the project into practice, initially I separated several ideas and stored them in the trello shared by us, after that we started the implementation of a prototype that is currently under development.": "A ideia principal desse projeto é criar um modo de jogo alternativo para o aclamado jogo Warframe, o novo modo de jogo é no estilo Idle, onde o jogador não precisa estar necessariamente a todo tempo jogando para poder progredir nele, a ideia surgiu pelos criadores desse projeto (Eu, @ThiagoCComelli e @MatheusAHM). Decidimos então por o projeto em prática, inicialmente separei varias ideias e armazenei no trello compartilhado por nós, depois disso iniciamos a implementação de um protótipo que está atualmente em desenvolvimento.",
  "The project is being developed with React, NodeJS, JavaScript/TypeScript, HTML and CSS/SCSS, the main idea came with the purpose of being a way to learn more and more with these technologies, in addition to being a project that motivates us on account of being something related to a game that we like a lot, which ends up making learning and development more fun.": "O projeto está sendo desenvolvido com React, NodeJS, JavaScript/TypeScript, HTML e CSS/SCSS, a ideia principal veio com o propósito de ser um meio de aprender cada vez mais com essas tecnologias, além de ser um projeto que nos motiva por conta de ser algo relacionado a um jogo que gostamos muito, oque acaba tornando o aprendizado e desenvolvimento mais divertido."
}
