{
  "oltpbench-project": {
    "title": "Dependency Rule Modeling for Multiple Aspects Trajectories",
    "description": "Trajectories of moving objects are usually modeled as sequences of space-time points or, in case of semantic trajectories, as labelled stops and moves. Data analytics methods on these kinds of trajectories tend to discover geometrical and temporal patterns, or simple semantic patterns based on the labels of stops and moves. A recent extension of semantic trajectories is called multiple aspects trajectory, i.e., a trajectory associated to different semantic dimensions called aspects. This kind of trajectory increases in a large scale the number of discovered patterns. This paper introduces the concept of dependency rule to represent patterns discovered from the analysis of trajectories with multiple aspects. They include patterns related to a trajectory, trajectory points, or the moving object. These rules are conceptually represented as an extension of a conceptual model for multiple aspects trajectories. A case study shows that our proposal is relevant as it represents the discovered rules with a concise but expressive conceptual model. Additionally, a performance evaluation shows the feasibility of our conceptual model designed over relational-based database management technologies.",
    "buttons" : [
      {
        "buttonTitle": "Scientific article",
        "buttonLink": "https://link.springer.com/chapter/10.1007/978-3-030-89022-3_11"
        
      },
      {
        "buttonTitle": "Oltpbench - GitHub",
        "buttonLink": "https://github.com/gustavogds/oltpbench"
      }
    ]
    
  },
  "pbad-project": {
    "title": "PBAD - Brazilian digital signature standard",
    "description": "The main objective of this Research Project is to provide a specialized solution that meets the specific legislation of Brazilian bodies in the context of digital signatures for validating digitally signed electronic documents of a specific nature. In Brazil, the use of digital signatures in electronic documents is regulated through Provisional Measure No. 2,200-2. Signed electronic documents permeate various aspects of society, such as contracts between entities, medical prescriptions, legal documents and invoices, and providing professional assistance in a fully digitized environment poses a series of challenges, among which stand out the need to guarantee the authenticity, integrity and veracity of documents used by service providers and their consumers. In its electronic form, it is necessary that such documents are obtained and verified by the recipients in an agile and safe way, the whole process involves the validation of qualitative attributes of the people who sign a health document, therefore, we have to place new elements in evidence of something new to be done at ICP-Brasil in a structured way. Teleworking poses challenges, in pandemic times, this modality makes it possible to reduce the risk of transmission of pathologies between professionals and the population served. Teleworking, combined with the technologies used to make this modality possible, provides and enables the provision of assistance in remote or difficult-to-access environments. It is observed that there is currently limited support for the practice of telecommuting in certain institutions. Thus, it is important to encourage research in this line, to study the issuance of signed receipts, particularly standardized methods to allow the creation of an artifact that enables the user to prove that, at a certain point, a digitally signed document was subjected to a digital signature verification service, makes it possible to provide solutions that serve society in general.",
    "buttons" : [
      {
        "buttonTitle": "PBAD/LabSec - Site",
        "buttonLink": "https://pbad.labsec.ufsc.br/"
      }
    ]
  }
}
